#include "pch.h"
#include "il2cpp_structs.h"

#define IL2CPP_CLASS il2cpp_class*

struct vp_FPWeaponReloader {
	IL2CPP_CLASS il2cpp_class;
	uintptr __nulldata_start;
	uintptr __internalObj;
	uintptr m_WeaponSystem; // 0x18
	uintptr m_PlayerControl; // 0x20
	uintptr m_Weapon; // 0x28
	uintptr m_Player; // 0x30
	uintptr m_Audio; // 0x38
	uintptr SoundReload; // 0x40
	uintptr AnimationReload; // 0x48
	float ReloadDuration; // 0x50
	float ReloadStart; // 0x54
	uintptr ReloadTex; // 0x58
	float ReloadDuration2; // 0x60
	float ReloadStart2; // 0x64
	uintptr ReloadTex2; // 0x68
};